Обработки/Reports/_КонтрольСроковДействияПаспортов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольСроковДействияПаспортов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольСроковДействияПаспортов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация 	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период  		= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СформироватьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СформироватьНаСервере()

	//Начало сессии
	ОтчетОбъект	= РеквизитФормыВЗначение("Отчет");
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация");
	Механизм = ОтчетОбъект.Метаданные().ПолноеИмя();
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);

	Отчет.Результат = ОтчетОбъект.СформироватьГипертекст();

	//Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	СформироватьНаСервере();

КонецПроцедуры
